{"id":2758,"date":"2022-07-03T23:24:37","date_gmt":"2022-07-03T18:54:37","guid":{"rendered":"https:\/\/virafruits.com\/?p=2758"},"modified":"2022-08-14T10:09:37","modified_gmt":"2022-08-14T05:39:37","slug":"royal-gala-apple","status":"publish","type":"post","link":"https:\/\/virafruits.com\/blog\/royal-gala-apple","title":{"rendered":"Royal Gala apple; history; nutrition value, and benefits"},"content":{"rendered":"\n<p><strong>Royal Gala apples<\/strong>&nbsp;are one of the most popular varieties and have even replaced the &#8216;Golden Delicious&#8217; variety in some countries. In particular, the low acidity makes the Gala apple very attractive as a dessert fruit and raw children&#8217;s apple. Also, Gala apples are ideal for dieters since they are low in calories and high in fiber.<\/p>\n\n\n\n<p><strong>Royal Gala<\/strong>&nbsp;apples are simply Gala apple mutations explicitly bred for their darker red skin color. At least half of the apple&#8217;s thin skin must be a deep red color to be considered a true Royal Gala. The hue of the Gala apple ranges from nearly complete red to yellow with crimson streaks. They&#8217;re also naturally lightly striped.<\/p>\n\n\n\n<p>Although the&nbsp;<strong>gala apples<\/strong>&nbsp;are usually picked in the fall (October through January are the Gala harvest months.), you can generally get them all year long at grocery shops.<\/p>\n\n\n\n<p>The Gala apple has a sweet flavor, a unique scent, and a firm, crisp texture. Eighty calories are in one medium apple, which weighs 5.5 ounces.<\/p>\n\n\n\r\n            <p class=\"link\"> Read More : <a  href=\"https:\/\/virafruits.com\/fruits\/apple\" target = \"_blank\"><strong>Iranian Apple<\/strong><\/a><\/p>             \r\n    \n\n\n\n<h2>History of gala apple<\/h2>\n\n\n\n<p>The apple variety Gala is a New Zealand breed by James Hutton Kidd. By crossing &#8216;Cox Orange&#8217; with &#8216;Red Delicious,&#8217; he got the variety &#8216;Kidds Orange Red.&#8217; He crossed this with Golden Delicious in 1934, which is how he got the Gala variety, which he brought onto the market in 1965.<\/p>\n\n\n\n<p>When the Queen of England visited New Zealand and tried an apple, she fell in love with them and gave them the name &#8220;royal&#8221;!<\/p>\n\n\n\n<figure class=\"wp-block-image size-full\"><img width=\"800\" height=\"500\" src=\"https:\/\/virafruits.com\/wp-content\/uploads\/2022\/07\/royal-gala-1.jpg\" alt=\"fresh royal gala at basket in garden\" class=\"wp-image-2770\"\/><\/figure>\n\n\n\n<h2>How to choose and store gala apples?<\/h2>\n\n\n\n<h3>Choosing royal gala apple<\/h3>\n\n\n\n<p>Choose gala apples with vivid, smooth, and glossy skin, deeply colored, and those that are unblemished. Ripe gala apples are golden yellow with slight pinkish-orange stripes.<\/p>\n\n\n\n<p>The firmness of the apples can be determined by holding them in your palm. You shouldn&#8217;t see any dark spots or soft spots on fresh Gala apples. The skin shouldn&#8217;t wrinkle when rubbed with your finger. If an apple develops wrinkles, it has either not been stored in cold storage for long enough or not cool enough.<\/p>\n\n\n\n<h3>Storing royal gala apple in home<\/h3>\n\n\n\n<p>Gala apples may be stored in the refrigerator and a cold place like all other apples. These apples also can be stored in place at room temperature for a few days and in the refrigerator for up to a month. The gala should be stored in a perforated plastic bag in the bottom drawer of your refrigerator.<\/p>\n\n\n\n<p>You must preserve your apple&#8217;s crispiness while allowing some moisture to escape. Also, You need to be careful not to stack them if you want to prevent bruising!<\/p>\n\n\n\n<p>It is better to avoid freezing raw apples, as they lose their taste and aroma too much; the consistency after defrosting is also not what it was before. But if you cut them into pieces and blanch them briefly, you can store them in the freezer for about six months and then use them for apple sauce or cake without any problems.<\/p>\n\n\n\n<p>Gala apples don&#8217;t freeze until their internal temperature falls below 28.5 degrees Fahrenheit.<\/p>\n\n\n\n<figure class=\"wp-container-2 wp-block-gallery-1 wp-block-gallery has-nested-images columns-default is-cropped\">\n<figure class=\"wp-block-image size-full\"><img width=\"800\" height=\"500\" data-id=\"2772\"  src=\"https:\/\/virafruits.com\/wp-content\/uploads\/2022\/07\/royal-gala-nutrition.jpg\" alt=\"gala apple in cold storage\" class=\"wp-image-2772\"\/><\/figure>\n<\/figure>\n\n\n\n<h3>Storing gala apple in cold storage<\/h3>\n\n\n\n<p>Royal gala apples can be kept under a controlled atmosphere for around one year using a special industrial storage system (CA or DCA).<\/p>\n\n\n\n<p>This variety can be stored well at temperatures around four °C, in a dark cellar, in frost-proof garages, or cool attics. It is essential that the apples are not yet fully ripe and that only top-quality fruit without rot or fungal diseases is stored.<\/p>\n\n\n\n<ol type=\"1\"><li>They should not be touching each other and should be stem-down on a shelf, wooden or plastic box (with holes). Apples should always be stored separately from different types of fruit and vegetables, as the ripening gas ethylene accelerates the ripening process of the neighbors and shortens their shelf life.<\/li><li>Gala apples may have slightly greasy skin after being stored for a long time. However, this is not a quality criterion; the wax layer is a natural protection of the apple against water loss and pathogens. many countries are also permitted in commercial fruit growing to apply an artificial layer of wax made from beeswax, carnauba wax (from the Brazilian carnauba palm), or shellac (from the lacquer scale insect<\/li><\/ol>\n\n\n\n<figure class=\"wp-block-image size-full\"><img width=\"800\" height=\"500\" src=\"https:\/\/virafruits.com\/wp-content\/uploads\/2022\/07\/gala-apples.jpg\" alt=\"royal gala apple slice\" class=\"wp-image-2767\"\/><\/figure>\n\n\n\n<h2>Royal Gala Benefits for Health (gala apple nutrition value)<\/h2>\n\n\n\n<p>Royal Gala is one of the top 5 healthiest apples available around. The health advantages of a large Gala apple are numerous. We have discussed these numerous benefits below, Most apples are similar in nutrient content, and gala is one of them.<\/p>\n\n\n\n<h3>The antioxidants in gala apples<\/h3>\n\n\n\n<p>Antioxidants are substances that stop or lessen oxidation, which shields the body&#8217;s cells and tissues from free radical damage. The &#8220;Nutrition Journal&#8221; of May 12, 2004, reported that apples&#8217; antioxidants could reduce the risk of heart disease, diabetes, and cancer. Gala apples are a major source of these damage-reparative compounds. Then The antioxidants in gala apples, like those in other apples, may aid in preventing the free radical damage that can result in diseases like cancer or heart disease.<\/p>\n\n\n\n<h3>Vitamins and mineral<\/h3>\n\n\n\n<p>A large royal gala apple will provide you with 10 mg of vitamin C, This nutrient assists in the production of collagen for healthy skin and wound healing, and this vitamin strengthens your immune system. In addition, vitamin C contains antioxidant capabilities that help it prevent free radical damage, which may cause diseases like cancer and heart disease. Males require 90 mg of vitamin C daily, while females need 75 mg.<\/p>\n\n\n\r\n            <p class=\"link\"> Read about : <a  href=\"https:\/\/virafruits.com\/blog\/granny-smith-apple\" target = \"_blank\"><strong>Granny smith apple advantages for health and weight loss<\/strong><\/a><\/p>             \r\n    \n\n\n\n<p>This apple variety has about 108 mg of potassium per 100 g with the peel. In addition to maintaining osmotic pressure in cells, potassium is also responsible for cell growth and normal blood pressure. Gala apple has a lot of potassium, one mineral. It can provide you with 5% of what your body needs to be healthy.<\/p>\n\n\n\n<p>Royal Gala apples also contain small amounts (0.5 mg\/100g ​​) of valuable vitamins, including vitamin B6 (pyridoxine). You need about 1.4 mg daily, organized in 100 g of sunflower seeds or dried onions to cover the daily requirement. Pyridoxine is a water-soluble vitamin involved in many enzymatic reactions and plays a vital role in protein metabolism.<\/p>\n\n\n\n<p>GALA apples also contain some thiamin (vitamin B1) (0.02 mg\/100g) and folate (3 µg\/100g.); vitamin E, lutein, and zeaxanthin. B vitamin is important for energy and carbohydrate metabolism, and folic acid is essential in cell growth and protein metabolism. Also, lutein and zeaxanthin may shield your eyes against macular degeneration and light-induced damage, and Vitamin E reduces oxidative stress, controls platelet aggregation, and strengthens the immune system.<\/p>\n\n\n\n<h3>Carbohydrates&nbsp;<\/h3>\n\n\n\n<p>The Mayo Clinic advises obtaining most of your calories from fruits, vegetables, and whole grains, so Gala apples are a smart option. Your body&#8217;s primary source of energy is carbohydrate-based.<\/p>\n\n\n\n<p>A 2,000 calorie diet, 225 to 325 g of carbs per day, or 45 to 65 percent of your total daily caloric intake, should be consumed. A sizable Gala apple has over 31 g of carbs.<\/p>\n\n\n\n<figure class=\"wp-block-image size-full\"><img width=\"800\" height=\"500\" src=\"https:\/\/virafruits.com\/wp-content\/uploads\/2022\/07\/royal-gala-benefits.jpg\" alt=\"gala apple in garden\" class=\"wp-image-2766\"\/><\/figure>\n\n\n\n<h3>fiber<\/h3>\n\n\n\n<p>Gala apples are high in fiber, much as all other varieties of apples. Apples include a dietary fiber known as pectin. An average Gala Apple weighs between 5 and 22 grams.<\/p>\n\n\n\n<p>Most of an apple&#8217;s fiber is found in its skin, so peeling it before eating it significantly lowers the amount of fiber you get.<\/p>\n\n\n\n<p>Fiber-rich meals make you feel fuller for longer, which might help you regulate your appetite. Including adequate fiber in your diet promotes healthy cholesterol, blood sugar levels, and digestion. Men require 28 to 34 g of fiber per day, while women need 22 to 28 g.<\/p>\n\n\n\r\n            <p class=\"link\"> Read about : <a  href=\"https:\/\/virafruits.com\/blog\/fruits-that-prevent-cancer-super-healthy\" target = \"_blank\"><strong>Fruits that prevent cancer, super healthy<\/strong><\/a><\/p>             \r\n    \n\n\n\n<h3>SUGAR<\/h3>\n\n\n\n<p>Apples contain fructose, a type of natural sugar that gives you a boost of energy. Although most people should limit their sugar intake, a sweet Gala apple is a better option than sugary beverages, candies, and processed foods since it has additional nutrients that benefit your health. There are around 23 g of sugar in a big Gala apple.<\/p>\n\n\n\n<h3>Phytochemicals and flavonoids<\/h3>\n\n\n\n<p>Apples contain protective compounds called flavonoids. It is known that flavonoids have antioxidant, antiviral, allergy, inflammatory, and antitumor effects on the body. According to research, phytochemicals can slow down the aging process.<\/p>\n\n\n\n<h3>Fat and calories<\/h3>\n\n\n\n<p>A practical method to sate hunger and manage your weight is to include meals that are low in fat and calories in your diet. Foods heavy in fat and calories can make you gain weight, which raises your chance of developing many health issues. A big Gala apple includes about 116 calories and less than 1 g of fat.<\/p>\n\n\n\n<figure class=\"wp-container-4 wp-block-gallery-3 wp-block-gallery has-nested-images columns-default is-cropped\">\n<figure class=\"wp-block-image size-full\"><img width=\"800\" height=\"500\" data-id=\"2769\"  src=\"https:\/\/virafruits.com\/wp-content\/uploads\/2022\/07\/royal-gala-india.jpg\" alt=\"gala apples in surface-suitable royal gala for food\" class=\"wp-image-2769\"\/><\/figure>\n<\/figure>\n\n\n\n<h2><strong>Enjoy the Royal Gala Apple in Food<\/strong><\/h2>\n\n\n\n<p>The Gala is a table fruit, its flesh is firm, juicy and pale yellow, and the taste is sweet and mild. Rubbing the apple with a kitchen towel gives it a nice shine. The crunchy apple tastes very good with its peel as a raw vegetable, in muesli, like a fruit salad, or grated as a raw vegetable salad with a wide variety of vegetables.<\/p>\n\n\n\n<p>The small to medium-sized apples are also good as baked apples, peeled and sliced ​​for baking cakes, tarts, strudel, etc., or steamed as compote and apple sauce. Apple juice made from Gala apples also tastes great and dried apple rings made from this variety are particularly sweet.<\/p>\n\n\n\n<p>Generally, One of the best apples to use in several ways is the Royal Gala! Let&#8217;s have a look at some of the top options.<\/p>\n\n\n\n<figure class=\"wp-block-image size-full\"><img width=\"800\" height=\"500\" src=\"https:\/\/virafruits.com\/wp-content\/uploads\/2022\/07\/shortcrust-pastry.jpg\" alt=\"apple pie-shortcrust pastry made with gala apple\" class=\"wp-image-2765\"\/><\/figure>\n\n\n\n<h3>The vegan recipe for apple pie:<\/h3>\n\n\n\n<p>Ingredients:<\/p>\n\n\n\n<p>&nbsp;200 g whole wheat flour, 100 g raw cane sugar, 100 g cold, vegan margarine, and approx. ½ tsp for greasing, one pinch of salt. For the topping: 750g Gala apples, 4 tbsp lemon juice, ¼ tsp bourbon vanilla, 1 ½ tsp ground cinnamon, 2 tbsp sultanas (raisins). For the crumble: 100 g wheat flour, 50 g margarine, 50 g raw cane sugar, and one pinch of salt.<\/p>\n\n\n\n<p>Preparation:<\/p>\n\n\n\n<p>Mix the flour, sugar, chopped margarine, and salt by hand or in a food processor to form a crumbly dough for the shortcrust pastry. Shape into a ball and let rest covered in the fridge until the next step.<\/p>\n\n\n\n<p>In the meantime, wash, peel, quarter, and core the apples. Cut the quartered pieces into 3 mm slices and mix with lemon juice. Add the vanilla, cinnamon, and sultanas and fold in. Now preheat the oven to 180 °C top\/bottom heat. Line a springform pan with a diameter of approx. 24 cm with baking paper and grease the edge. Distribute the shortcrust pastry evenly in the mold and press flat. Also, form an approx. 2 cm high edge with the dough (e.g., with the back of a spoon). Spread the sliced ​​apples on the cake base. For the crumbles, mix all the ingredients and process them into coarse crumbles by hand or in a blender. Spread evenly over the cake. Bake on the middle rack for about 40-50 minutes, allow the cake to cool before serving, and remove from the springform pan.<\/p>\n\n\n\n<figure class=\"wp-container-6 wp-block-gallery-5 wp-block-gallery has-nested-images columns-default is-cropped\">\n<figure class=\"wp-block-image size-full\"><img width=\"800\" height=\"500\" data-id=\"2764\"  src=\"https:\/\/virafruits.com\/wp-content\/uploads\/2022\/07\/concentrated-apple-juice.jpg\" alt=\"concentrated apple juice-apple juice\" class=\"wp-image-2764\"\/><\/figure>\n<\/figure>\n\n\n\n<h3>The vegan recipe for apple sweetener or concentrated apple juice:<\/h3>\n\n\n\n<p>Ingredients:<\/p>\n\n\n\n<p> 1.5 kg Gala apples (alternatively another sweet variety such as &#8216;Golden Delicious&#8217;), 4&#215;250 ml sterilized screw-top jars or small glass bottles.<\/p>\n\n\n\n<p>Preparation:<\/p>\n\n\n\n<p>&nbsp;Wash the apples, quarter them and extract the juice using a juicer. A medium-fine pomace sieve is suitable here. Approx. 1.2 l apple juice and approx. 400 g pomace remain. Now boil the apple juice in a pot for about 20 minutes and reduce it to about 1 l. The thick juice must be poured into the clean jars while still hot, sealed, and allowed to cool. The apple sweetener can be stored in the refrigerator for approx. 4-6 weeks, frozen it can be used much longer. Apple sweetener can be used instead of sugar to sweeten cakes, cookies, or bread, similar to agave syrup (agave syrup). The pomace keeps in the fridge for about 2-3 days and is suitable for baking cakes and thickening sauces.<\/p>\n\n\n\n<h4>In summary<\/h4>\n\n\n\n<p>Gala Apple nutrition appears to qualify this fruit for inclusion in our regular diet. It is one of the most excellent alternatives to feed your kids and boost their eating habits because of its sweet flavor.<\/p>\n\n\n\n<p>Additionally, several apple nutrients, such as the soluble fiber pectin, may help maintain a healthy balance in the gut flora, enhance blood lipid levels, and guard against cardiovascular disease. Benefits are increased when paired with polyphenols. The gala apple has many health benefits and is easily available in all seasons of the year.<\/p>\n\n\n\n<p><\/p>\n\n\n\n<h4>FAQ<\/h4>\n\n\n\n<p><\/p>\n\n\n\n<h3>What complements Royal Gala?<\/h3>\n\n\n\n<p>Royal Gala goes well with bold, unique flavors like herbs, ginger, wine, and fresh cheeses because of their sweetness.<\/p>\n\n\n\n<h3>How can I choose a ripe gala?<\/h3>\n\n\n\n<p>A ripe Gala has a creamy yellow to golden yellow background and intense red color on the surface. The apple is not yet fully ripe if the background color is green. A beautiful mature color depends very much on sun exposure during growth.<\/p>\n\n\n\n<h3>How can I cook using Royal Gala?<\/h3>\n\n\n\n<p>Royal Gala apples go great with a charcuterie platter that includes cheese, nuts, meats, and robust red wine. On a grilled sandwich with brie cheese, caramelized onions, and thinly sliced Royal Gala, you may also add them. Because it prevents it from becoming mealy, its crispness makes it a great baking apple.<\/p>\n\n\n\n<h3>Can I eat Royal Gala as a snack?<\/h3>\n\n\n\n<p>This apple variety is a fantastic choice for a snack! Its medium size makes it simple to consume, yet its firm, crisp flesh takes time to brown.<\/p>\n\n\n\n<h3>Is Royal Gala Kid-friendly?<\/h3>\n\n\n\n<p>Absolutely, yes! It&#8217;s a fantastic choice for picky eaters. This apple type is a wonderful choice if your child is infamous for rejecting apples when they start to turn brown since, as was already noted, it takes a bit longer than typical to become brown.<\/p>\n\n\n\n<script type=\"application\/ld+json\">\n{\n  \"@context\": \"https:\/\/schema.org\",\n  \"@type\": \"FAQPage\",\n  \"mainEntity\": [{\n    \"@type\": \"Question\",\n    \"name\": \"What complements Royal Gala?\",\n    \"acceptedAnswer\": {\n      \"@type\": \"Answer\",\n      \"text\": \"Royal Gala goes well with bold, unique flavors like herbs, ginger, wine, and fresh cheeses because of their sweetness.\"\n    }\n  },{\n    \"@type\": \"Question\",\n    \"name\": \"How can I choose a ripe gala?\",\n    \"acceptedAnswer\": {\n      \"@type\": \"Answer\",\n      \"text\": \"A ripe Gala has a creamy yellow to golden yellow background and intense red color on the surface. The apple is not yet fully ripe if the background color is green. A beautiful mature color depends very much on sun exposure during growth.\"\n    }\n  },{\n    \"@type\": \"Question\",\n    \"name\": \"How can I cook using Royal Gala?\",\n    \"acceptedAnswer\": {\n      \"@type\": \"Answer\",\n      \"text\": \"Royal Gala apples go great with a charcuterie platter that includes cheese, nuts, meats, and robust red wine. On a grilled sandwich with brie cheese, caramelized onions, and thinly sliced Royal Gala, you may also add them. Because it prevents it from becoming mealy, its crispness makes it a great baking apple.\"\n    }\n  },{\n    \"@type\": \"Question\",\n    \"name\": \"Can I eat Royal Gala as a snack?\",\n    \"acceptedAnswer\": {\n      \"@type\": \"Answer\",\n      \"text\": \"This apple variety is a fantastic choice for a snack! Its medium size makes it simple to consume, yet its firm, crisp flesh takes time to brown.\"\n    }\n  },{\n    \"@type\": \"Question\",\n    \"name\": \"Is Royal Gala Kid-friendly?\",\n    \"acceptedAnswer\": {\n      \"@type\": \"Answer\",\n      \"text\": \"Absolutely, yes! It's a fantastic choice for picky eaters. This apple type is a wonderful choice if your child is infamous for rejecting apples when they start to turn brown since, as was already noted, it takes a bit longer than typical to become brown.\"\n    }\n  }]\n}\n<\/script>\n","protected":false},"excerpt":{"rendered":"<p>Royal Gala apples&nbsp;are one of the most popular varieties and have even replaced the &#8216;Golden Delicious&#8217; variety in some countries. In particular, the low acidity makes the Gala apple very attractive as a dessert fruit and raw children&#8217;s apple. Also, Gala apples are ideal for dieters since they are low in calories and high in [&hellip;]<\/p>\n","protected":false},"author":11,"featured_media":2763,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v15.5 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<meta name=\"description\" content=\"The Royal Gala apple has numerous health advantages. Although they are in season in the summer and fall, most stores sell apples all year round.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/virafruits.com\/blog\/royal-gala-apple\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"The royal gala apple: everything you need to know\" \/>\n<meta property=\"og:description\" content=\"The Royal Gala apple has numerous health advantages. Although they are in season in the summer and fall, most stores sell apples all year round.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/virafruits.com\/blog\/royal-gala-apple\" \/>\n<meta property=\"og:site_name\" content=\"Vira Fruits Export\" \/>\n<meta property=\"article:published_time\" content=\"2022-07-03T18:54:37+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2022-08-14T05:39:37+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/virafruits.com\/wp-content\/uploads\/2022\/07\/royal-gala-apple-1.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"800\" \/>\n\t<meta property=\"og:image:height\" content=\"500\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:label1\" content=\"Est. reading time\">\n\t<meta name=\"twitter:data1\" content=\"9 minutes\">\n<!-- \/ Yoast SEO plugin. -->","_links":{"self":[{"href":"https:\/\/virafruits.com\/wp-json\/wp\/v2\/posts\/2758"}],"collection":[{"href":"https:\/\/virafruits.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/virafruits.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/virafruits.com\/wp-json\/wp\/v2\/users\/11"}],"replies":[{"embeddable":true,"href":"https:\/\/virafruits.com\/wp-json\/wp\/v2\/comments?post=2758"}],"version-history":[{"count":15,"href":"https:\/\/virafruits.com\/wp-json\/wp\/v2\/posts\/2758\/revisions"}],"predecessor-version":[{"id":2921,"href":"https:\/\/virafruits.com\/wp-json\/wp\/v2\/posts\/2758\/revisions\/2921"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/virafruits.com\/wp-json\/wp\/v2\/media\/2763"}],"wp:attachment":[{"href":"https:\/\/virafruits.com\/wp-json\/wp\/v2\/media?parent=2758"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/virafruits.com\/wp-json\/wp\/v2\/categories?post=2758"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/virafruits.com\/wp-json\/wp\/v2\/tags?post=2758"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}